# Getting Started with Pandas

In [1]:
# To get started with pandas you will need to get comfortable with its two 
# workhorse data structures: Series and DataFrame. While they are not a universal 
# solution for every problem, they provide a solid easy-to-use basis for most applications. 
import pandas as pd 
from pandas import Series, DataFrame 
import numpy as np 

# Series is a one-dimensional array-like object containing a sequence of values 
# and an associated array of data labels, called its index. The simplest Series
# is formed from only an array of data: 

obj = Series([4, 7, -5, 3]) 
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [2]:
# The string representation of a Series displayed interactively shows the index on the left
# and the values on the right. Since we did not specify an index for the data, a default
# one consisting of the integers 0 through N - 1 (where N is the length of the data) is
# created. You can get the array representation and index object of the Series via its values
# and index attributes, respectively: 
obj.values

array([ 4,  7, -5,  3])

In [3]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) 
obj2['a']

-5

In [5]:
obj2['d'] = 6 
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [6]:
# Numpy array operations, such as filtering with a boolean array, scalar multiplication, 
# or applying math functions, will preserve the index-value link: 

obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [7]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [8]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [9]:
# Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping
# of index values to data values. It can be substituted into many functions that expect a
# dict: 

'b' in obj2

True

In [10]:
'e' in obj2

False

In [11]:
# Should you have data contained in a Python dict, you can create a Series from it by passing the dict: 

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} 
obj3 = Series(sdata) 
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas'] 
obj4 = Series(sdata, index=states)

In [13]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [14]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [16]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [18]:
obj4.name = 'population' 
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [19]:
# A Series's index can be altered in place by assignment 
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan'] 
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

In [20]:
# A DataFrame represents a tabular spreadsheet-like data structure containing an ordered collection 
# of columns, each of which can be a different value type (numeric, string, boolean,etc..)
# The DataFrame has both a row and column index: it can be thought of as dict of Series all sharing 
# the same index. Under the hood, the data is stored as one or more two-dimensional blocks rather than 
# a list, dict, or some other collection of one-dimensional arrays. 

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
        }
frame = DataFrame(data) 
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [21]:
# If you specify a sequence of columns, the DataFrame's  columns will be arranged in that order:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
# As with Series, if you pass a column that isn't contained in data, it will appear with NA values in the result: 

frame2 = DataFrame(data, columns= ['year', 'state', 'pop', 'debt'], 
                    index=['one', 'two', 'three', 'four','five']) 
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [23]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [24]:
# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute: 
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [25]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [26]:
# Note that returned Series have the same index as the DataFrame, and their name attribute has been appropriately set. 
# Rows can also be retrieved by position or name with the special loc attribute: 
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [28]:
# Columns can be modified by assignment. 
# For example, the empty debt column could be assigned a scalar values or an array of values
frame2['debt'] = 16.5 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [29]:
frame2['debt'] = np.arange(5.) 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [30]:
# when assigning lists or arrays to a column, the value's legnth must match the length of the DataFrame. 
# If you assign a Series, its labels will be realigned exactly to the DataFrame's index, inserting missing values in any holes:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']) 
frame2['debt'] = val 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [31]:
# Assigning a column that doesn't exist will create a new column. The del keyword will delete columns as with a dict:
frame2['eastern'] = frame2.state == 'Ohio' 
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [32]:
del frame2['eastern']

In [33]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [37]:
# Another common form of data is a nested dict of dicts format:
# If passed to DataFrame, it will interpret the outer dict keys as the columns and the inner
# keys as the row indices:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
        } 
frame3 = DataFrame(pop) 
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [38]:
# You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array: 
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [39]:
# The keys in the inner dicts are unioned and sorted to form the index in the result. 
# This isn't true if an explicit index is specified: 
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [40]:
# Dicts of Series are treated much in the same way: 
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]
        } 
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [43]:
# For a complete list of things you can pass the DataFrame constructor, see Table 5-1. 
# If a DataFrame's index and columns have their name attributes set, these will also be displayed: 
frame3.index.name = 'year' ; frame3.columns.name = 'state'

In [44]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [45]:
# Like Series, the values attribute returns the data contained in the DataFrame as a 2D ndarray: 
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [46]:
# If the DataFrame's columns are different dtypes, the dtype of the values array will be chosen to accomodate all of the columns:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

# Index Objects

In [47]:
# pandas's Index objects are responsible for holding the axis labels and other metadata (like the axis name or names). 
# Any array or other sequence of labels used when constructing a Series or DataFrame is internally converted to an Index:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [48]:
index[1:]

Index(['b', 'c'], dtype='object')

In [49]:
# Index objects are immutable and thus can't be modified by the user:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [50]:
# Immutability is important so that Index objects can be safely shared among data structures: 
index = pd.Index(np.arange(3)) 
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [51]:
# Index methods and properties
# Method     Description
# append >>>> Concatenate with additional Index objects, producing a new Index
# diff >>>> Compute set difference as an Index
# intersection >>>> Compute set intersection
# union >>>> Compute set union
# isin >>>>> Compute boolean array indicating whether each value is contained in the passed collection
# delete >>>>> Compute new Index with element at index i deleted
# drop >>>>>> Compute new index by deleting passed values
# insert >>>>>> Compute new Index by inserting element at index i
# is_monotonic >>>>>> Returns True if each element is greater than or equal to the previous element
# is_unique >>>>> Returns True if the Index has no duplicate values
# unique >>>>>>>> Compute the array of unique values in the Index

# Essential Functionality

In [3]:
# A critical method on pandas objects is reindex, which means to create a new object with the data conformed to a new index. 
# Consider an example:
import pandas as pd 
from pandas import Series, DataFrame 
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c']) 
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) 
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [6]:
# For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing.
# The method option allows us to do this, using a method such as ffill which forward fills the values: 
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4]) 
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [8]:
# ffill or pad Fill (or carry) values forward
# bfill or backfill Fill (or carry) values backward
import numpy as np 
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California']) 
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [9]:
frame2 = frame.reindex(['a', 'b', 'c', 'd']) 
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [10]:
# The columns can be reindexed using the columns keyword:
states = ['Texas', 'Utah', 'California'] 
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [15]:
# Both can be reindexed in one shot, though interpolation will only apply row-wise(axis 0):
# frame3 = frame.reindex(index=['a','b','c','d','e'],method='ffill', columns=states)

In [16]:
# Argument  Description
# index >>>>> New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. 
# An Index will be used exactly as is without any copying
# method >>>>> Interpolation (fill) method, see Table 5-4 for options.
# fill_value >>> Substitute value to use when introducing missing data by reindexing
# limit >>>>> When forward- or backfilling, maximum size gap to fill
# level >>>>>> Match simple Index on level of MultiIndex, otherwise select subset of
# copy >>>>>>> Do not copy underlying data if new index is equivalent to old index. True by default (i.e. always copy data).

# Dropping entries from an axis

In [17]:
# Dropping one or more entries from an axis is easy if you have an index array or list without those entries. 
# As that can require a bit of munging and set logic, 
# the drop method will return a new object with the indicated value or values deleted from an axis: 

obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c') 
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [18]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [19]:
# With DataFrame, index values can be deleted from either axis: 
data = DataFrame(np.arange(16).reshape((4,4)), 
                index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns=['one', 'two', 'three', 'four'])

In [20]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [22]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Indexing, selection, and filtering

In [3]:
# Series indexing (obj[...]) works analogously to NumPy array indexing, 
# except you can use the Series's index values instead of only integers.
# Here are some examples of this: 
import pandas as pd 
from pandas import Series, DataFrame 
import numpy as np 
obj = Series(np.arange(4.), index=['a','b','c','d'])

In [4]:
obj['b']

1.0

In [5]:
obj[1]

1.0

In [6]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [7]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [8]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [9]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [10]:
# Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive: 
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [11]:
# Setting using these methods modifies the corresponding section of the Series: 
obj['b':'c']=5 
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [14]:
data = DataFrame(np.arange(16).reshape((4,4)),
                                        index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                                        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [16]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [17]:
# Indexing like this has a few special cases. First selecting rows by slicing or a boolean array: 
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [18]:
data[data['three'] > 5 ]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
# This might seem inconsistent to some readers, but this syntax arose out of practicality
# and nothing more. Another use case is in indexing with a boolean DataFrame, such as
# one produced by a scalar comparison:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [22]:
data[data < 5] = 0 
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Arithmetic and data alignment

In [25]:
# One of the most important pandas features is the behavior of arithmetic between objects with different indexes. 
# When adding together objects, if any index pairs are not the same, the respective index in the result will be the 
# union of the index pairs. Let's look at a simple example: 
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e']) 
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c','e','f','g'])

In [26]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [27]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [28]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [29]:
# The internal data alignment introduces NA values in the indices that don't overlap. 
# Missing values propagate in arithmetic computations. 
# In the case of DataFrame, alignment is performed on both the rows and the columns:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), 
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), 
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [30]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [31]:
# Adding these together returns a DataFrame whose index and columns are the unions of the ones in each DataFrame:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

# Arithmetic methods with fill values

In [32]:
# In arithmetic operations between differently-indexed objects, you might want to fill with a special value, like 0,
# when an axis lable is found in one object but not the other:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd')) 
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [33]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [34]:
# Using the add method on df1, I pass df2 and an argument to fill_value: 
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [35]:
# Related, when reindexing a Series or DataFrame, you can also specify a different fill value: 
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

# Operations between DataFrame and Series

In [36]:
arr = np.arange(12.).reshape((3,4)) 
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [37]:
arr[0]

array([0., 1., 2., 3.])

In [38]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [40]:
# This is referred to as broadcasting and is explained in more detail as it relates to general NumPy arrays in Appendix A. 
# Operations between a DataFrame and a Series are similar: 
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), 
                index=['Utah', 'Ohio', 'Texas', 'Oregon']) 
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [41]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [42]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [43]:
# If index value is not found in either the DataFrame's columns 
# or the Series's index the objects will be reindexed to form the union: 
series2 = Series(range(3), index=['b','e','f']) 
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [44]:
# If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods. 
# For example: 
series3 = frame['d']

In [45]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [49]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [50]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# Function application and mapping

In [53]:
# numpy ufuncs (element-wise array methods) also work with pandas objects:  

frame = DataFrame(np.random.randn(4,3), columns=list('bde'), 
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.636950 -0.852192 -2.138170
Ohio    0.574295  2.117920  0.709083
Texas   1.396467 -0.525180 -1.122089
Oregon -0.307569 -0.011423  0.838930

In [54]:
np.abs(frame)

               b         d         e
Utah    1.636950  0.852192  2.138170
Ohio    0.574295  2.117920  0.709083
Texas   1.396467  0.525180  1.122089
Oregon  0.307569  0.011423  0.838930

In [55]:
# Another frequent operation is applying a function on 1D arrays to each column or row. 
# DataFrame's apply method does exactly this: 
f = lambda x: x.max() - x.min() 
frame.apply(f)

b    3.033417
d    2.970112
e    2.977100
dtype: float64

In [56]:
frame.apply(f, axis=1)

Utah      1.285978
Ohio      1.543626
Texas     2.518556
Oregon    1.146499
dtype: float64

In [57]:
# Many of the most common array statistics (like sum and mean) are DataFrame methods,
# so using apply is not necessary. The function passed to apply need not return a scalar value,
# it can also return a Series with multiple values:
def f(x): 
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d        e
min -1.636950 -0.852192 -2.13817
max  1.396467  2.117920  0.83893

In [58]:
# Element wise python functions can be used, too.
# Suppose you wanted to compute a formatted string from each floating point value in frame.
# You can do this with applymap: 
format = lambda x: '%.2f' % x 
frame.applymap(format)

            b      d      e
Utah    -1.64  -0.85  -2.14
Ohio     0.57   2.12   0.71
Texas    1.40  -0.53  -1.12
Oregon  -0.31  -0.01   0.84

In [59]:
# The reason for the name applymap is that Series has a map method for applying an element-wise function: 
frame['e'].map(format)

Utah      -2.14
Ohio       0.71
Texas     -1.12
Oregon     0.84
Name: e, dtype: object

# Sorting and Ranking

In [60]:
# Sorting a data set by some criterion is another important built-in operation. 
# To sort lexicographically by row or column index, use the sort_index method, which returns a new, sorted object: 
obj = Series(range(4), index=['d','a','b','c']) 
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [61]:
# with a DataFrame, you can sort by index on either axis: 
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], 
                columns=['d','a','b','c']) 
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [62]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [63]:
# The data is sorted in ascending order by default, but can be sorted in descending order, too: 
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [65]:
# To sort a Series by its values, use its order method: 
obj = Series([4,7,-3,2]) 
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [66]:
# Any missing values are sorted to the end of the Series by default: 
obj = Series([4,np.nan,7,np.nan,-3,2]) 
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [67]:
# On DataFrame, you may want to sort by the values in one or more columns. 
# To do so, pass one or more column names to the by option: 
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]}) 
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [68]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [69]:
# To sort by multiple columns, pass a list of names:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [70]:
# Ranking assigns ranks from one through the number of valid data points in an array. 
# The rank methods for Series and DataFrame are the place to look; 
# by default rank breaks ties by assigning each group the mean rank: 
obj = Series([7,-5,7,4,2,0,4]) 
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [71]:
# Ranks can also be assigned according to the order in which they are observed in the data: 
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [72]:
# Naturally, you can rank in descending order, too: 
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [73]:
frame = DataFrame({'b':[4.3,7,-3,2], 'a':[0,1,0,1], 'c':[-2,5,8,-2.5]}) 
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [74]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [9]:
# Tie-breaking methods with rank
# Method   Description
# 'average' >>>> Default: assign the average rank to each entry in the equal group.
# 'min' >>>>>  Use the minimum rank for the whole group.
# 'max' >>>>> Use the maximum rank for the whole group.
# 'first' >>>>>> Assign ranks in the order the values appear in the data.

# Axis indexes with duplicate values

In [2]:
import pandas as pd 
from pandas import Series, DataFrame 
obj = Series(range(5), index=['a','a','b','b','c']) 
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [3]:
# The index's is_unique property can tell you whether its values are unique or not: 
obj.index.is_unique

False

In [4]:
# Data selection is one of the main things that behaves differently with duplicates. 
# Indexing a value with multiple entries returns a Series while single entries return a scalar value: 
obj['a']

a    0
a    1
dtype: int64

In [5]:
obj['c']

4

In [7]:
# The same logic extends to indexing rows in a DataFrame:
import pandas as pd 
from pandas import Series, DataFrame 
import numpy as np  
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b']) 
df

          0         1         2
a -0.426409  1.858564 -1.022951
a -0.111662 -0.359925 -0.634481
b  1.317512 -0.732318 -0.619308
b  1.972433  1.178128  0.407985

# Summarizing and Computing Descriptive Statistics

In [4]:
# pandas objects are equipped with a set of common mathematical and statistical methods. 
# Most of these fall into the category of reductions or summary statistics, methods that extract 
# a single value like the sum or mean from a Series or a Series of values from the rows or columns of a DataFrame. 
# Compared with the similar methods found on NumPy arrays, they have built-in handling for missing data. 
# Consider a small DataFrame:
import pandas as pd 
from pandas import Series, DataFrame
import numpy as np
df = DataFrame([[1.4, np.nan], [7.1, -4.5], 
                [np.nan, np.nan], [0.75, -1.3]], 
                index=['a','b','c','d'], columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
# Calling DataFrame's sum method returns a Series containing column sums: 
df.sum()

one    9.25
two   -5.80
dtype: float64

In [7]:
# Passing axis=1 sums over the rows instead: 
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [2]:
# NA values are excluded unless the entire slice (row or column in this case) is NA. 
# This can be disabled with skipna option: 
df.mean(axis=1, skipna=False)

NameError: name 'df' is not defined

In [12]:
# Options for reduction methods 
# Method    Description 
# axis >>>  Axis to reduce over. 0 for DataFrames rows and 1 for columns.
# skipna >>>> Exclude missing values, True by default.
# level >>> Reduce grouped by level if the axis is hierarchically-indexed (MultiIndex).

In [13]:
# Some methods, like idxmin and idxmax, return indirect statistics like the index value
# where the minimum or maximum values are attained: 
df.idxmax()

one    b
two    d
dtype: object

In [14]:
df.idxmin()

one    d
two    b
dtype: object

In [15]:
# Other methods are accumulations: 
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [16]:
# Another type of method is neither a reduction nor an accumulation. 
# describe is one such example, producing multiple summary statistics in one shot: 
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [17]:
# Descriptive and summary statistics
# Method   Description
# count >>>> Number of non-NA values
# describe >>>> Compute set of summary statistics for Series or each DataFrame column
# min, max >>>>> Compute minimum and maximum values
# argmin, argmax >>>>> Compute index locations (integers) at which minimum or maximum value obtained, respectively
# idxmin, idxmax >>>>> Compute index values at which minimum or maximum value obtained, respectively
# quantile >>>>> Compute sample quantile ranging from 0 to 1
# sum >>>>>> Sum of values
# mean >>>>>> Mean of values
# median >>>>> Arithmetic median (50% quantile) of values
# mad >>>> Mean absolute deviation from mean value
# var >>>>>> Sample variance of values
# std >>>>>>> Sample standard deviation of values
# skew >>>>> Sample skewness (3rd moment) of values
# kurt >>>>>> Sample kurtosis (4th moment) of values
# cumsum >>>>>>> Cumulative sum of values
# cummin, cummax >>>>>>>> Cumulative minimum or maximum of values, respectively
# cumprod >>>>>>>>>> Cumulative product of values
# diff >>>>>>>>> Compute 1st arithmetic difference (useful for time series)
# pct_change >>>>>>>> Compute percent changes

# Correlation and Covariance

In [19]:
# Some summary statistics, like correlation and covariance, are computed from pairs of arguments. 
# Let's consider some DataFrames of stock prices and volumes obtained from Yahoo! 
# Finance using the add-on pandas- datareader package. 
# If you don't have it installed already, it can be obtained via conda or pip:

# ! pip install pandas-datareader

In [24]:
# ! pip install yfinance

In [25]:
import yfinance as yf
import pandas as pd

all_data = {}
start_date = '2000-01-01'
end_date = '2010-01-01'

for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = yf.download(ticker, start=start_date, end=end_date)

price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})
returns = price.pct_change()

print(price.head())
print(volume.head())
print(returns.head())

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
                AAPL        IBM       MSFT  GOOG
Date
2000-01-03  0.847207  61.026123  36.132252   NaN
2000-01-04  0.775779  58.954655  34.911705   NaN
2000-01-05  0.787131  61.026123  35.279812   NaN
2000-01-06  0.719014  59.973984  34.098019   NaN
2000-01-07  0.753073  59.710922  34.543617   NaN
                 AAPL       IBM      MSFT  GOOG
Date
2000-01-03  535796800  10823694  53228400   NaN
2000-01-04  512377600   8606279  54119000   NaN
2000-01-05  778321600  13318927  64059600   NaN
2000-01-06  767972800   8338607  54976600   NaN
2000-01-07  460734400  12402108  62013600   NaN
                AAPL       IBM      MSFT  GOOG
Date
2000-01-03       NaN       NaN       NaN   NaN
2000-01-04 -0.084310 -0.033944 -0.033780   NaN
2000-01-05  0.014633  0.035137  0.010544   NaN
2000-01-06 -0.086539 -0.017241 -0.033498   NaN
2000-01-07  0.047369 -0.004386  0.013068   NaN

In [26]:
# The corr method of series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series. 
# Relatedly, cov computes the covariance: 
returns['MSFT'].corr(returns['IBM'])

0.4959799452417764

In [27]:
returns['MSFT'].cov(returns['IBM'])

0.00021595785203218758

In [28]:
# Data frames corr and cov methods 
# on the other hand, return a full correlation or covariance matrix as a DataFrame respectively: 
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.410011  0.424305  0.470676
IBM   0.410011  1.000000  0.495980  0.390688
MSFT  0.424305  0.495980  1.000000  0.443587
GOOG  0.470676  0.390688  0.443587  1.000000

In [29]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001027  0.000252  0.000309  0.000303
IBM   0.000252  0.000367  0.000216  0.000142
MSFT  0.000309  0.000216  0.000516  0.000205
GOOG  0.000303  0.000142  0.000205  0.000580

In [33]:
# Passing a DataFrame computes the correlation or covariance of all the columns: 
returns.corrwith(volume)

AAPL   -0.057549
IBM    -0.007892
MSFT   -0.014245
GOOG    0.062648
dtype: float64

In [34]:
# Passing axis=1 does things row-wise instead. 
# In all cases, the data points are aligned by label before computing the correlation: 
returns.corrwith(volume, axis=1)

Date
2000-01-03         NaN
2000-01-04   -0.996426
2000-01-05   -0.414276
2000-01-06   -0.985343
2000-01-07    0.972109
                ...
2009-12-24    0.978819
2009-12-28    0.429945
2009-12-29   -0.720846
2009-12-30    0.562115
2009-12-31    0.624321
Length: 2515, dtype: float64

# Unique Values, Value Counts, and Membership